In [2]:
import pandas as pd

In [6]:
a = pd.DataFrame({"Name":["Abir","Trijal",None,"Kanishka"],"Gender":["M","M","M",None],"Age":[21,None,22,23]})
print(a)

       Name Gender   Age
0      Abir      M  21.0
1    Trijal      M   NaN
2      None      M  22.0
3  Kanishka   None  23.0

In [17]:
print(a)
print(a.ffill())
# print(a.fillna(obj.ffill()))
print(a.bfill())
# print(a.fillna(method="bfill"))

       Name Gender   Age
0      Abir      M  21.0
1    Trijal      M   NaN
2      None      M  22.0
3  Kanishka   None  23.0
       Name Gender   Age
0      Abir      M  21.0
1    Trijal      M  21.0
2    Trijal      M  22.0
3  Kanishka      M  23.0
       Name Gender   Age
0      Abir      M  21.0
1    Trijal      M  22.0
2  Kanishka      M  22.0
3  Kanishka   None  23.0

In [4]:
a[["Name"]]

       Name
0      Abir
1    Trijal
2  Kanishka

In [5]:
a["Name"]

0        Abir
1      Trijal
2    Kanishka
Name: Name, dtype: object

In [6]:
a[["Name","Age"]]

       Name  Age
0      Abir   21
1    Trijal   22
2  Kanishka   23

In [7]:
a["Class"]:["UK","UK","UK"]
print(a)

       Name Gender  Age
0      Abir      M   21
1    Trijal      M   22
2  Kanishka      M   23

In [8]:
a["State"]=["AS","WB","PB"]
print(a)

       Name Gender  Age State
0      Abir      M   21    AS
1    Trijal      M   22    WB
2  Kanishka      M   23    PB

In [9]:
a.insert(2, "CGPA", [10, 10, 10])

In [10]:
print(a)

       Name Gender  CGPA  Age State
0      Abir      M    10   21    AS
1    Trijal      M    10   22    WB
2  Kanishka      M    10   23    PB

In [11]:
a.dtypes

Name      object
Gender    object
CGPA       int64
Age        int64
State     object
dtype: object

In [12]:
a.keys()

Index(['Name', 'Gender', 'CGPA', 'Age', 'State'], dtype='object')

In [13]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
a.columns

Index(['Name', 'Gender', 'CGPA', 'Age', 'State'], dtype='object')

In [15]:
a["Kuch Bhi"]=["ese","wese","kese"]
print(a)

       Name Gender  CGPA  Age State Kuch Bhi
0      Abir      M    10   21    AS      ese
1    Trijal      M    10   22    WB     wese
2  Kanishka      M    10   23    PB     kese

In [16]:
a.pop("Kuch Bhi")

0     ese
1    wese
2    kese
Name: Kuch Bhi, dtype: object

In [17]:
print(a)

       Name Gender  CGPA  Age State
0      Abir      M    10   21    AS
1    Trijal      M    10   22    WB
2  Kanishka      M    10   23    PB

In [18]:
a.to_csv("K23Pandas.csv")

In [19]:
read = pd.read_csv("K23Pandas.csv")
type(read)
print(read)

   Unnamed: 0      Name Gender  CGPA  Age State
0           0      Abir      M    10   21    AS
1           1    Trijal      M    10   22    WB
2           2  Kanishka      M    10   23    PB

In [3]:
b = pd.DataFrame({"Name":["AB","TJ","KA","AM"],"Age":[20,21,22,23],"Add":["AS","WB","PB","PB"]},index=["A","B","C","D"])
print(b)

  Name  Age Add
A   AB   20  AS
B   TJ   21  WB
C   KA   22  PB
D   AM   23  PB